public class Main {
    public static void main(String[] args) {
        int m; // мили к получению
        int p; // цена билета
        int x; // цена мили
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили
        p = 45488;
        x = 20;
        m = p / x;
        System.out.println(m +" миль вы получите при покупке билета");
    // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
